artillery.yml
config:
  target: 'http://localhost:4000'
  phases:
    - duration: 600
      arrivalRate: 10
scenarios:
  - flow:
      - log: 'Getting token'
      - post:
          url: '/login'
          json:
            login: 'admin'
            password: 'admin'
          capture:
            json: '$.token'
            as: token
          expect:
            - statusCode: 200
      - get:
          headers:
            Authorization: 'Bearer {{ token }}'
          url: '/users'
      - post:
          headers:
            Authorization: 'Bearer {{ token }}'
          url: '/users'
          json:
            login: 'test'
            password: 'test'
            name: 'Foo'
          capture:
            json: '$.id'
            as: userId
      - get:
          headers:
            Authorization: 'Bearer {{ token }}'
          url: '/users/{{ userId }}'
      - put:
          headers:
            Authorization: 'Bearer {{ token }}'
          url: '/users/{{ userId }}'
          json:
            login: 'test1'
            password: 'test1'
            name: 'Foo1'
      - delete:
          headers:
            Authorization: 'Bearer {{ token }}'
          url: '/users/{{ userId }}'